---
kind: property
id: P:Autodesk.Revit.DB.IFCExportOptions.FilterViewId
source: html/927884ac-60b2-fe93-faac-8212d26ebd6a.htm
---
# Autodesk.Revit.DB.IFCExportOptions.FilterViewId Property

Id of the view whose visibility settings will govern the contents in the exported IFC file.

## Syntax (C#)
```csharp
public ElementId FilterViewId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null